print("\n Умова: Школа вирішила сформувати три нові групи учнів та надати їм окремі класи. У кожному класі необхідно встановити столи для учнів, у розрахунку, що за одним столом може сидіти не більше двох учнів. Яку мінімальну кількість столів необхідно придбати? "

        "\n Вхідні дані: 3 цілих числа - кількість учнів у кожній групі.  Кожне число користувач вводить в окремому рядку."

        "\n Вихідні дані: число - кількість столів \n")

class1 = int(input())
class2 = int(input())
class3 = int(input())

print(class1 % 2 + class2 % 2 + class3 % 2 + class1 // 2 + class2 // 2 + class3 // 2)